## `dev`
#### Terraform Format and Style 🖌`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
module.src_api.data.aws_route_table.main: Reading...
module.src_api.aws_ecr_repository.main: Refreshing state... [id=ectr-dev-i231-sample]
module.src_api.aws_ecs_cluster.main: Refreshing state... [id=arn:aws:ecs:ap-northeast-1:471112955196:cluster/ecls-dev-I231-sample]
module.src_api.aws_eip.sample_eip: Refreshing state... [id=eipalloc-0fd57579f5d48863e]
module.src_api.aws_iam_policy.ssm_policy: Refreshing state... [id=arn:aws:iam::471112955196:policy/ssm-policy]
module.src_api.aws_ecs_cluster.jump_server: Refreshing state... [id=arn:aws:ecs:ap-northeast-1:471112955196:cluster/ecls-dev-I231-jumpserver]
module.src_api.aws_iam_role.code_deploy_role: Refreshing state... [id=code_deploy_role]
module.src_api.aws_s3_bucket.elb_logs: Refreshing state... [id=s3-dev-i231-elbaccesslog]
module.src_api.data.aws_route_table.public: Reading...
module.src_api.aws_ssm_parameter.github_pat: Refreshing state... [id=PAT]
module.src_api.data.aws_subnet.public_subnet_a: Reading...
module.src_api.data.aws_subnet.subnet_c: Reading...
module.src_api.aws_iam_role.ecs_role: Refreshing state... [id=ecs_role]
module.src_api.data.aws_route_table.main: Read complete after 1s [id=rtb-0ad75363c371989ca]
module.src_api.data.aws_subnet.subnet_a: Reading...
module.src_api.data.aws_route_table.public: Read complete after 1s [id=rtb-0b44ac3933a945d1c]
module.src_api.data.aws_vpc.vpc: Reading...
module.src_api.data.aws_subnet.subnet_b: Reading...
module.src_api.aws_secretsmanager_secret_version.github_token: Refreshing state... [id=github_token|0C944648-48B4-4DF6-AFFB-999B432503AC]
module.src_api.aws_iam_role.codebuild_role: Refreshing state... [id=codebuild-role]
module.src_api.data.aws_subnet.public_subnet_a: Read complete after 0s [id=subnet-0842ee2071bb1093a]
module.src_api.aws_iam_policy_attachment.ecs_secretsmanager_readwrite: Refreshing state... [id=ecs_secretsmanager_readwrite]
module.src_api.aws_ecs_task_definition.main: Refreshing state... [id=etsk-dev-I231-soumu]
module.src_api.data.aws_subnet.subnet_c: Read complete after 0s [id=subnet-029983d62d52dde8a]
module.src_api.aws_route_table_association.public_sample_1d: Refreshing state... [id=rtbassoc-0ed80119caba9b800]
module.src_api.data.aws_subnet.subnet_a: Read complete after 0s [id=subnet-0813446eda2ab1d8e]
module.src_api.aws_nat_gateway.sample_nat_gateway: Refreshing state... [id=nat-06d6998e15005fd9a]
module.src_api.aws_route_table_association.public_1d: Refreshing state... [id=rtbassoc-0aa42bc2ff4b719bf]
module.src_api.data.aws_subnet.subnet_b: Read complete after 1s [id=subnet-0bbf03a5ca6653d46]
module.src_api.aws_route_table_association.public_1a: Refreshing state... [id=rtbassoc-053b2d5193e01c7c5]
module.src_api.aws_route_table_association.public_1c: Refreshing state... [id=rtbassoc-061f0ef432c21118a]
module.src_api.aws_iam_role_policy_attachment.ssm_policy_attachment: Refreshing state... [id=codebuild-role-20240520060318717100000002]
module.src_api.aws_codebuild_project.codebuild_project: Refreshing state... [id=arn:aws:codebuild:ap-northeast-1:471112955196:project/codebuild-project]
module.src_api.aws_iam_role_policy_attachment.codebuild_policy: Refreshing state... [id=codebuild-role-20240520060318009800000001]
module.src_api.aws_iam_role_policy.codebuild_cloudwatch_policy: Refreshing state... [id=codebuild-role:codebuild_cloudwatch_policy]
module.src_api.data.aws_vpc.vpc: Read complete after 2s [id=vpc-069f656ea9de1a173]
module.src_api.aws_internet_gateway.main: Refreshing state... [id=igw-0df2684f85b6f32c7]
module.src_api.aws_security_group.alb: Refreshing state... [id=sg-05e7473256e7acfc7]
module.src_api.aws_security_group.ecs: Refreshing state... [id=sg-0e128cba7c80f754e]
module.src_api.aws_lb_target_group.main: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:471112955196:targetgroup/tg-dev-I231-sample-app/1f01ba7fb6617641]
module.src_api.aws_route.main: Refreshing state... [id=r-rtb-0ad75363c371989ca1080289494]
module.src_api.aws_security_group_rule.alb: Refreshing state... [id=sgrule-3820212078]
module.src_api.aws_lb.main: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:471112955196:loadbalancer/app/alb-dev-I231-sample/fad192a1cb902534]
module.src_api.aws_security_group_rule.ecs: Refreshing state... [id=sgrule-802564425]
module.src_api.aws_lb_listener.main: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:471112955196:listener/app/alb-dev-I231-sample/fad192a1cb902534/717aab984128cce3]
module.src_api.aws_ecs_service.main: Refreshing state... [id=arn:aws:ecs:ap-northeast-1:471112955196:service/ecls-dev-I231-sample/esvc-dev-I231]
module.src_api.aws_lb_listener_rule.main: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:471112955196:listener-rule/app/alb-dev-I231-sample/fad192a1cb902534/717aab984128cce3/7fc2f6dc01feb852]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.src_api.aws_route.main will be updated in-place
  ~ resource "aws_route" "main" {
      + gateway_id             = "igw-0df2684f85b6f32c7"
        id                     = "r-rtb-0ad75363c371989ca1080289494"
        # (5 unchanged attributes hidden)
    }

  # module.src_api.aws_s3_bucket.elb_logs will be updated in-place
  ~ resource "aws_s3_bucket" "elb_logs" {
        id                          = "s3-dev-i231-elbaccesslog"
        tags                        = {}
        # (10 unchanged attributes hidden)

      - server_side_encryption_configuration {
          - rule {
              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.src_api.aws_secretsmanager_secret_version.github_token must be replaced
-/+ resource "aws_secretsmanager_secret_version" "github_token" {
      ~ arn            = "arn:aws:secretsmanager:ap-northeast-1:471112955196:secret:github_token-C4pPPk" -> (known after apply)
      ~ id             = "github_token|0C944648-48B4-4DF6-AFFB-999B432503AC" -> (known after apply)
      ~ secret_id      = "github_token" -> "yuuking0304" # forces replacement
      ~ version_id     = "0C944648-48B4-4DF6-AFFB-999B432503AC" -> (known after apply)
      ~ version_stages = [
          - "AWSCURRENT",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.

Warning: Version constraints inside provider configuration blocks are deprecated

  on provider.tf line 2, in provider "aws":
   2:   version = "3.6.0"

Terraform 0.13 and earlier allowed provider version constraints inside the
provider configuration block, but that is now deprecated and will be removed
in a future version of Terraform. To silence this warning, move the provider
version constraint into the required_providers block.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>